apply_cp/system/board/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    defaultFaces
    {
        type            patch;
    }
}

T
{
    internalField   uniform 300;
 	"procBoundary.*"
     {
            type            processor;
     }

    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
            value           uniform 300;
        }

        ".*_to_air"
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            qrNbr           qr;
            qr              none;
            value           uniform 300;
        }


        "soc_to_.*"
        {
            type            compressible::turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     solidThermo;
            value           uniform 300;
        }
    }
}


// ************************************************************************* //
